---
kind: method
id: M:Autodesk.Revit.DB.TextNote.RemoveLeaders
zh: 注释、文字注释
source: html/7c4568a2-a761-db16-1c8e-78602745e5fa.htm
---
# Autodesk.Revit.DB.TextNote.RemoveLeaders Method

**中文**: 注释、文字注释

Removes all leaders currently attached to the text note.

## Syntax (C#)
```csharp
public void RemoveLeaders()
```